# WasExtraCheckBoxChecked Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..WasExtraCheckBoxChecked Method
TaskDialog Class See Also
---
Gets the status of the extra checkbox.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public bool WasExtraCheckBoxChecked()
```

Visual Basic
---
```text
Public Function WasExtraCheckBoxChecked As Boolean
```

Visual C++
---
```text
public:
bool WasExtraCheckBoxChecked()
```

# ### Return Value
Whether the extra checkbox is checked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the task dialog does not have an extra checkbox or the task dialog is not shown yet. |

# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace